{
  "basics": {
    "name": "Mayank Tahilramani",
    "label": "Cloud Networking Technology Specialist",
    "picture": "./self.jpeg",
    "email": "Mayank.Tahil@gmail.com",
    "website": "http://mayank.tahil.site",
    "summary": "Experienced tech specialist who isn't afraid to automate anything and everything! Skilled in Pre-Sales, Customer Service, Networking, Cloud, Docker, and Automation. Advocate of Open Source Software (OSS), Open Source Knowledge Sharing, and the ongoing shift of agile transformation at the data center and in the cloud.",
    "location": {
      "city": "Seattle",
      "region": "Washington",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "@MayankTahil",
        "url": "https://www.linkedin.com/in/mayanktahil/"
      },
      {
        "network": "GitHub",
        "username": "@MayankTahil",
        "url": "https://github.com/MayankTahil"
      },
      {
        "network": "GitHub",
        "username": "@Citrix-TechSpecialist (Founder)",
        "url": "https://github.com/Citrix-TechSpecialist"
      },
      {
        "network": "SoundCloud",
        "username": "@Mayankt",
        "url": "https://hub.docker.com/u/mayankt"
      }
    ]
  },
  "work": [
    {
      "company": "Citrix Systems",
      "position": "Cloud Networking Technical Specialist",
      "description": "Seattle, WA",
      "website": "https://www.citrix.com/",
      "startDate": "2015-09-15",
      "summary": "Cloud, Networking, and DevOps subject matter expert supporting Sales and Professional Services within the Americas Geo. Dedicated to the acquisition, development, and dissemination of technical knowledge to customers and field resources to help overcome sales barriers and progress technology adoption. In perpetual collaboration with Product Managers, Sales Engineers, Developers, and Sales Leadership to enrich Citrix's networking portfolio. Functioning as a Citrix technology evangelist at industry events such Cisco Live, Citrix Synergy, DockerCon, etc.",
      "highlights": [
        "Directly impacted multi-million dollars in pipeline generation every quarter. Facilitated over $2 million in sales revenue through direct customer engagement and development of POC Demo environments that field resources across all geo's leverage to sell and position Citrix Solutions.",
        "Responsible for developing subject matter expertise in Citrix products as well as complementary/competitive technologies within the industry such as Docker, Rancher, Kubernetes, OpenStack, and AWS.",
        "Involved in establishing best practices for new product releases, gathering product enhancement feedback, and developing/delivering technical trainings.",
        "Leader in architecting and building novel POC environments for customers and field resources globally. Committed to building demo environments through self R&D to better  sell, enable, improve, and intellectually contribute towards Citrix Networking Solutions.",
        "Recognized instructor responsible for curriculum development and delivery of Instructor Led Trainings (ILTs). Trainings focus on sales and positioning, as well as technical enablement through hands on learning for new hires and experienced field resources."
      ]
    },
    {
      "company": "Citrix Systems",
      "position": "Pre-Sales Engineer",
      "website": "https://www.citrix.com/",
      "startDate": "2016-03-16",
      "endDate": "2016-06-21",
      "summary": "Focused on selling Citrix's Networking portfolio centered around NetScaler. Responsible for developing technical relationships with customers and prospects. Assisted Territory Managers and sales representatives in identifying and matching technology opportunities with customer business needs.",
      "highlights": [
        "Built the curriculum and presented weekly customer facing webinars to further generate sales pipeline focusing on Citrix networking solutions (NetScaler ADC / MAS, Application Firewall, and NetScaler SD-WAN.",
        "Influenced $100,000+ in active pipeline while engaged as a technical resource for customer calls, product demonstrations, and remote proof of concepts.",
        "Delivered technical sales training for Territory Managers and Sales Representatives by instructing on product communication workflows, competitive differentiation, and positioning Citrix products to business needs."
      ]
    },
    {
      "company": "Citrix Systems",
      "position": "Technical Analyst",
      "website": "https://www.citrix.com/",
      "startDate": "2015-09-15",
      "endDate": "2016-03-16",
      "summary": "Functioned as an on-site resource within Citrix Consulting Services during enterprise customer engagements by leading discussions, configuring production environments, delivering customer presentations, and documenting final deliverables.",
      "highlights": [
        "Valued project resource on Citrix Consulting engagements. Distilled technical content with it's business value to C-level stakeholders.",
        "Consulted enterprise customers through requirement gathering, architectural design, build, and deploying of Citrix Virtualization solutions.",
        "Alumni of Citrix's Leadership Development Program, which provides technical enablement through Instructor Led Trainings, experience in Citrix Consulting methodology, and obtainment of Microsoft Windows Server Certifications (MCSA, MCTS, and MCPS)."
      ]
    },
    {
      "company": "LabAnswer",
      "position": "Consultant",
      "website": "http://www.labanswer.com/",
      "startDate": "2014-10-01",
      "endDate": "2015-07-19",
      "summary": "Served as a Consultant to fortune 500 pharmaceutical clients and genomic laboratories to help strategize, architect, implement, and support scientific data management and laboratory automation projects. Specialized in Clarity LIMS and Exemplar LIMS software.",
      "highlights": [
        "Led requirement gathering meetings and developed a Java based enhancement plug-in to Exemplar LIMS software (COTS) which allows scientists to easily query their database and generate dynamic PDF reports of automated bench test results.",
        "Provided urgent LIMS compliance validation services to a fortune 500 pharmaceutical client under consent decree through test script development, executions, and master data loading.",
        "Experienced in LabWare v6 and modern web-based LIMS such as Clarity and Exemplar LIMS which cater to large scale genomic and NEXTgen sequencing laboratories.",
        "Optimized day-to-day tasks by developing modules/libraries to interact with REST APIs and parse through XML via code in Python and Groovy for data handling, processing, and automation."
      ]
    },
    {
      "company": "Neurological Biomaterials and Cancer Therapeutics Laboratory at Georgia Institute of Technology",
      "position": "Lab Affiliate",
      "website": "http://www.bellamkondalab.net/",
      "startDate": "2014-10-01",
      "endDate": "2015-07-19",
      "summary": "Helped engineer a novel micro neural implant for bi-directonal neural interfacing with the Peripheral Nervous System for robotic limb control. This DARPA sponsored research directly addresses current amputees’ lack of ability to consciously control mobility and receive sensation from smart prosthetic limbs.",
      "highlights": [
        "Performed  surgeries, histological and electrophysiology studies on murine models for chronic in vivo trials to investigate host acceptance post implantation of medical device. Published a manuscript as second author on resulting nerve and biological response.",
        " Performed and developed protocols to assemble the micro medical device post clean room fabrication. Optimized bench top workflow (hours to minutes) by utilizing Arduino (C/C++) to identify micro wires and associated PCB micro bonding pads during device fabrication. Furthermore, optimized data analysis through coding in Python."
      ]
    }
  ],
  "education": [
    {
      "institution": "Georgia Institute of Technology",
      "area": "Biochemistry (Focus in Neural Engineering)",
      "studyType": "Bachelors of Science (B.S.)",
      "startDate": "2010-08-01",
      "endDate": "2013-12-18",
      "gpa": "3.28",
      "courses": [
        "Head Research Assistant - School of Chemistry and Biochemistry at Georgia Institute of Technology",
        "Lab Affiliate - Dr. Bellamkonda's Neurological Biomaterials and Cancer Therapeutics Laboratory",
        "Honorary Graduate - Dean's List all quarters in attendance",
        "Georgia HOPE Scholar"
      ]
    }
  ],
  "awards": [
    {
      "title": "Presidential Undergraduate Research Award (PURA) at Georgia Institute of Technology",
      "date": "2013-05-01",
      "awarder": "Georgia Institute of Technology",
      "summary": "$1,500 Presidential Undergraduate Research Grant to develop a thick tissue histological analysis protocol to study brain matter."
    }
  ],
  "publications": [
    {
      "name": "Deploying NetScaler CPX in Google Container Engine (GKE)",
      "publisher": "GitHub @Citrix-TechSpecialist",
      "releaseDate": "2017-4-13",
      "website": "https://github.com/Citrix-TechSpecialist/GKE-cpx-proxy/",
      "summary": "Instruction on how to deploy NetScaler CPX within a Kubernetes cluster on Google Cloud to take on the functional role of KubeProxy and thereby load-balance and auto-discover microservices."
    },
    {
      "name": "Introduction to Docker 101",
      "publisher": "GitHub @Citrix-TechSpecialist",
      "releaseDate": "2017-7-18",
      "website": "https://github.com/Citrix-TechSpecialist/Docker-101/",
      "summary": "Introduction to key concepts in containerization. This tutorial focuses on gaining hands on experience in running Docker containers, creating Docker images, executing Docker commands, and automating deployments such as a container driven 'Interactive developer environment' using docker-compose."
    },
    {
      "name": "Introduction to NetScaler VPX in AWS",
      "publisher": "GitHub @Citrix-TechSpecialist",
      "releaseDate": "2017-7-07",
      "website": "https://github.com/Citrix-TechSpecialist/NetScaler-in-AWS-101/",
      "summary": "Introduction to key concepts of AWS Cloud. This tutorial focuses on gaining hands on experience with cloud networking (VPCs), provisioning instances (EC2), managing persistent storage (EFS and S3), and configuring a NetScaler VPX in the cloud."
    },
    {
      "name": "A regenerative microchannel device for recording multiple single-unit action potentials in awake, ambulatory animals",
      "publisher": "European Journal of Neuroscience",
      "releaseDate": "2015-10-28",
      "website": "http://onlinelibrary.wiley.com/doi/10.1111/ejn.13080/full?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3By7JCjXuTSzKf%2BgVf3NAjKg%3D%3D",
      "summary": "This study reports on the development of a fully integrated, regenerative microchannel interface with microelectrodes for nerve signal extraction and capabilities to enabling evaluation in an awake and ambulatory rat animal model. This study marks a significant advance in neural interfacing, demonstrating the capability of microchannels to be used for communicating with peripheral nerves."
    },
    {
      "name": "Microchannels as a Regenerative Construct for Peripheral Nerve Interfacing.",
      "publisher": "Biomaterials",
      "releaseDate": "2015-02-01",
      "website": "https://www.ncbi.nlm.nih.gov/pubmed/25522974?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3B86eGMF1VRHmFBu%2BFCUvwXA%3D%3D",
      "summary": "These studies showed that precisely fabricated microchannels support and direct the regeneration/migration of axons, Schwann cells, and fibroblasts through the microchannels during nerve regeneration and recovery. Results provided evidence that the construct is biologically compatible for in vivo peripheral neural interfacing."
    }
  ],
  "skills": [
    {
      "name": "Coding / Scripting",
      "keywords": [
        "Python",
        "Java",
        "Bash / Shell",
        "HTML",
        "YAML"
      ]
    },
    {
      "name": "Leadership",
      "keywords": [
        "Instructor Led Trainings",
        "Mentorship",
        "Project Management",
        "Thought Leadership"
      ]
    },
    {
      "name": "Sales",
      "keywords": [
        "Customer Service",
        "Qualifying Opportunities",
        "Pipeline Management",
        "Sales Prospecting"
      ]
    },
    {
      "name": "Operating Systems",
      "keywords": [
        "Mac OS X",
        "Debian / Ubuntu",
        "Alpine",
        "Windows Desktop",
        "Windows Server 2008 / 2012",
        "Rancher OS"
      ]
    },
    {
      "name": "Cloud",
      "keywords": [
        "AWS",
        "Google Cloud (GKE)",
        "OpenStack",
        "SoftLayer"
      ]
    },
    {
      "name": "Containers",
      "keywords": [
        "Docker",
        "Docker Compose",
        "Rancher",
        "Kubernetes",
        "CodeFresh (CI/CD)",
        "Drone (CI/CD)"
      ]
    },
    {
      "name": "Automation",
      "keywords": [
        "Cloud Init",
        "Ansible",
        "Helm",
        "Citrix Smart Tools"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Hindi",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Reddit",
      "keywords": [
        "r/selfhosted",
        "r/homelab",
        "r/Seattle"
      ]
    },
    {
      "name": "IOT",
      "keywords": [
        "Raspberry Pi",
        "Octoblu",
        "ResinOS"
      ]
    },
    {
      "name": "Hiking",
      "keywords": [
        "Mount Ranier",
        "Mount Hood",
        "Big Four Ice Caves"
      ]
    },
    {
      "name": "Wildlife",
      "keywords": [
        "Dog Owner (Akiela)",
        "Cat Owner (Winston)",
        "Animal Shelter Volunteer"
      ]
    },
    {
      "name": "Bioscience",
      "keywords": [
        "Neuroscience",
        "Neural Biomedical Engineering",
        "Genomics"
      ]
    },
    {
      "name": "Open Source Software",
      "keywords": [
        "GitHub Projects",
        "Self Hosted Services",
        "Homelab"
      ]
    },
    {
      "name": "Self Hosting",
      "keywords": [
        "Home Media Center",
        "Container Cloud",
        "OwnCloud"
      ]
    },
    {
      "name": "Home Cooking",
      "keywords": [
        "Smoked Ribs & BBQ",
        "Tiramisu",
        "Pizza"
      ]
    },
    {
      "name": "Instructing",
      "keywords": [
        "AP / College Tutoring",
        "Technology Workshops",
        "Instructor Led Training"
      ]
    },
    {
      "name": "Public Speaking",
      "keywords": [
        "Thought Leadership",
        "Citrix Evangelist",
        "DevOps"
      ]
    },
    {
      "name": "Neural Engineering",
      "Keywords": [
        "PNI",
        "Neurology",
        ""
      ]
    }
  ]
}